{
  "menu": {
    "intro": "Introduction",
    "shows": "Shows",
    "gallery": "Gallery",
    "contact": "Contact"
  },
  "intro": {
    "paragraphs": [
      {
        "subtitle": "",
        "text": "Welcome to the website of the Norde Gard reenactment team! We have been in the business of presenting the way of life and tactics of the 10th-11th century Nordic tribes and the 6 th -7 th century Germanic tribes in the Carpathian Basin since 2006 As for the ancient Nordic peoples, we introduce to our audiences the life the Vikings, an often-used misnomer in public discourse, and those of Saint Steven’s mediaeval Slavic bodyguards. When reenacting the period of migration, we present the culture and warfare of the Germanic peoples of the Carpathian Basin, especially the Gepids and the Lombards."
      },
      {
        "text": "We invite those interested to take a closer look at the daily lives, customs and struggles of these peoples, and get a more authentic picture about the aforementioned periods of history. Our team continuously monitors research from these eras and the results of the latest excavations. Many of our members are well established archaeologists, historians and professionals of other related disciplines and crafts and are connected through their work and daily lives to the historic periods we present. We design our equipment and programs based on this knowledge in order to create the most authentic image. In addition to preserving traditions, our reenactment team has been featured in American, Austrian, Canadian and British educational and entertainment movie productions. The support we receive from museums adds great value to our work and enables us to access important scientific materials from original sources. We would like to thank the Aquincum Museum, the War History Institute and Museum, the “Sticker” Museum and Archeological Park as well as the students and teachers of ELTE University and Pázmány Péter University for their support."
      }
    ]
  },
  "shows": {
    "title_early": "EARLY MIDDLE AGES SHOWS (10th-11th CENTURY)",
    "paragraphs_early": [
      {
        "subtitle": "COMBAT DEMONSTRATIONS",
        "text": "During our show, we recreate a historic battle scene for visitors, where they can see in practice the use of the era's weapons and armor, as well as period combat techniques. This demonstration can be supplemented with duels, presentations of soldier training, as well as demonstrations of real sharp weapons usage and cutting techniques."
      },
      {
        "subtitle": "EVERDAY LIFE SHOWS",
        "text": "In these special history classes the children can study the historical clothes, weapons, religions and habits first hand. We provide historical classes in the folowing topics: St. Steven the first and vikings, The Norsemens, Migration-period Germanic tribes in the Carpathian basin. We can do presentations on other topics based on personal consultation."
      }
    ],
    "title_migration": "MIGRATION-PERIOD SHOWS (6th-7th CENTURY)",
    "paragraphs_migration": [
      {
        "subtitle": "COMBAT DEMONSTRATIONS",
        "text": "During our show, we recreate a historic battle scene for visitors, where they can see in practice the use of the era's weapons and armor, as well as period combat techniques. This demonstration can be supplemented with duels, presentations of soldier training, as well as demonstrations of real sharp weapons usage and cutting techniques."
      },
      {
        "subtitle": "EVERDAY LIFE SHOWS",
        "text": "We provide an insight into the everyday life of Nordic people who lived in the Carpathian Basin in the 10 th -11 th centuries and who are also referred to in historiography as St. Stephen’s bodyguards. Visitors can view their tents, the contemporary furniture, weapons, armor, clothing and tools they used in their everyday lives. On request, we also present through a tour the various everyday life activity of a contemporary camp and introduce the different characters the members of our reenactment team impersonate. The show can be complemented by a contemporary cooking demonstration and an introduction to contemporary toys with offering children a chance to play with."
      }
    ],
    "paragraphs_children": [
      {
        "subtitle": "KIDS PROGRAMS",
        "text": "Our team undertakes to organize various kids programs as part of our historical reenactment presentation where we introduce kids to contemporary toys and crafts. During the games, kids can put themselves to the test in skill games such as Caber toss, the ancient Nordic “kub” and a tug of war competition with a team of four. They can also try medieval fencing with padded weapons as well as contemporary boardgames. In handicraft classes they can learn about the craft of claying, felting and spinning."
      }
    ],
    "paragraphs_history_class": [
      {
        "subtitle": "SPECIAL HISTORY CLASSES IN SCHOOLS",
        "text": "In these special history classes the children can study the historical clothes, weapons, religions and habits first hand. We provide historical classes in the folowing topics: St. Steven the first and vikings, The Norsemens, Migration-period Germanic tribes in the Carpathian basin. We can do presentations on other topics based on personal consultation."
      }
    ]
  },
  "gallery": {
    "title": "",
    "description": ""
  },
  "contact": {
    "title": "CONTACT",
    "content": "Please get in touch with us through any of the contact options below."
  },
  "footer": {
    "rights": "All rights reserved © Norde Gard 2026"
  }
}
